Repository: clip-itk/clip-itk
Catalog: clip/locale.po/*.KOI8-R/codb.po
Languages: ru_ru

source: 1028:Error open meta index table:
ru_ru: 1028:Ошибка открытия таблицы мета индексов:

source: in
ru_ru: в

source: This extent only for undefined objects.
ru_ru: Это пространство только для неизвестных объектов.

source: Error in expression:
ru_ru: Ошибка в выражении:

source: Internal error:
ru_ru: Внутренняя ошибка:

source: Error compiling WHERE expression:
ru_ru: Ошибка компиляции выражения WHERE:

source: Character
ru_ru: Строка

source: Numeric
ru_ru: Число

source: Date
ru_ru: Дата

source: Logical
ru_ru: Логическое

source: Memo text
ru_ru: Текст

source: Object
ru_ru: Объект

source: Any data
ru_ru: Любые данные

source: Reference to object
ru_ru: Ссылка на объект

source: Reference to class
ru_ru: Ссылка на класс

source: References array
ru_ru: Массив ссылок

source: Executable code (code block)
ru_ru: Исполняемый код (кодовый блок)

source: CLIP source as plugins
ru_ru: Подключаемый модуль

source: Linked procedure
ru_ru: Прилинкованная процедура

source: CLIP source file as codeblock
ru_ru: Блок кода из файла

source: Shared loadable library
ru_ru: Дин.загружаемая библиотека

source: Linked module with main function
ru_ru: Прилинкованный модуль с функциями

source: As is
ru_ru: Как есть

source: Right trim
ru_ru: Удаление cправа

source: Right & Left trim
ru_ru: Удаление справа и слева

source: Right pad length
ru_ru: Добавление справа

source: None
ru_ru: Нет

source: Optimization
ru_ru: Оптимизация

source: Must exist
ru_ru: Должен быть

source: Last value +1
ru_ru: Последнее значение +1

source: MAX value +1
ru_ru: Максимальное значение +1

source: Can`t open log depository
ru_ru: Невозможно открыть журнал

source: Class Description not found in log depository
ru_ru: Описание класса не найдено в журнале

source: Error append to log depository
ru_ru: Ошибка добавления в журнал

source: Invalid dictionary identification
ru_ru: Ошибочный идентификатор словаря

source: Dictionary not inizialized
ru_ru: Словарь не активирован

source: Already exist dictionary with ID
ru_ru: Уже существует словарь с ID

source: Not found dictionary with ID
ru_ru: Не найден словарь с ID

source: Error locking record
ru_ru: Ошибка блокирования записи

source: Error find dictionary ID
ru_ru: Не найден словарь с ID

source: Invalid arguments
ru_ru: Неправильный аргумент

source: System error
ru_ru: Системная ошибка

source: Dictionary path not inizialized
ru_ru: Словарь не активизирован

source: Dictionary already exist
ru_ru: Словарь уже существует

source: Can`t create file
ru_ru: Невозможно создать файл

source: Error SEEK metaIdx identification
ru_ru: Ошибка SEEK идентификатора в метаиндексе

source: Can~t read CODB version
ru_ru: Невозможно прочитать версию CODB

source: CODB version is not compatible! Please run program codb_make for convertation data
ru_ru: Версия CODB несовместима!

source: Dictionary counters open error
ru_ru: Ошибка открытия счетчиков словаря

source: Error open meta data table
ru_ru: Ошибка открытия таблицы метаданных

source: Error open meta index table
ru_ru: Ошибка открытия таблицы метаиндексов

source: Can~t make directory
ru_ru: Невозможно создать директорию

source: Can`t open counters database
ru_ru: Невозможно открыть таблицу счетчиков

source: Not defined filename in plugins
ru_ru: Не определено имя файла для модуля

source: Not defined main function in plugins
ru_ru: Не определена главная процедура в модуле

source: Plugins file not found
ru_ru: Файл модуля не найден

source: Error loading plugins
ru_ru: Ошибка загрузки модуля

source: Module file not found
ru_ru: Файл модуля не найден

source: Error loading module
ru_ru: Ошибка загрузки модуля

source: Error loading shared library
ru_ru: Ошибка загрузки библиотеки

source: Plugins main function not found
ru_ru: Не найдена главная процедура модуля

source: Plugins main function not found in linked modules
ru_ru: Не найдена главная процедура модуля

source: Main function not has method "MEMBERS" in plugins
ru_ru: Главная процедура не имеет метода "MEMBERS"

source: Non unique name of new class
ru_ru: Не уникальное имя класса

source: Can`t check class ID for data
ru_ru: Невозможно проверить ID класса для объекта

source: Meta name not defined
ru_ru: Метаназвание не определно

source: Bad attribute name
ru_ru: Плохое имя аттрибута

source: Depository identification not found
ru_ru: Не найден идентификатор депозитария

source: Depository already exist
ru_ru: Депозитарий уже существует

source: Error create file
ru_ru: Ошибка создания файла

source: Can~t create directory
ru_ru: Невозможно создать директорию

source: Can~t read CODB version !
ru_ru: Невозможно прочитать версию CODB

source: Error open extent
ru_ru: Ошибка открытия пространства

source: Can`t seek in refTable object ID
ru_ru: Не найден в таблице ссылок объект с ID

source: Can`t seek in idxTable object ID
ru_ru: Не найден в таблице индексов объект с ID

source: Depository counters open error
ru_ru: Ошибка открытия счетчиков депозитария

source: Error open ref table
ru_ru: Ошибка открытия таблицы ссылок

source: Error open data index table
ru_ru: Ошибка открытия таблицы индексов

source: Extent ID not defined
ru_ru: Пространство не определено

source: Extent already exist
ru_ru: Пространство уже существует

source: Empty object ID
ru_ru: Пустой идентификатор объекта ID

source: Eval expression error
ru_ru: Ошибка в выражении

source: Bad depository number or identification
ru_ru: Плохой идентификатор или номер депозитария

source: Can`t open extent with empty ID
ru_ru: Невозможно открыть пространство с ID

source: Non unique object attribute
ru_ru: Не уникальное значение аттрибута

source: Unknown internal depository error
ru_ru: Неизвестная внутреняя ошибка

source: Counter`s not activated
ru_ru: Счетчики не активированы

source: Counter ID not found
ru_ru: Не найден счетчик с ID

source: Error locking counter ID
ru_ru: Ошибка блокировки счетчика с ID

source: Counter unknown error in Add value
ru_ru: Неизвестная ошибка в счетчике

source: Count ID not defined
ru_ru: Не известен счетчик с ID

source: Counter ID already exist
ru_ru: Уже существует счетчик с ID

source: Counter file already exist
ru_ru: Файл счетчиков уже существует

source: Error open extent table
ru_ru: Ошибка открытия пространства

source: Can`t seek in extent Table object ID
ru_ru: Не найден в пространстве объект с ID

source: Can`t lock object with ID
ru_ru: Невозможно заблокировать объект с ID

source: Can`t found class name in query expression
ru_ru: Не нейдено имя класса в выражении запроса

source: Unknown error code
ru_ru: Неизвестный код ошибки
