Repository: clip-itk/clip-itk
Catalog: clip/locale.po/*.KOI8-R/sys.po
Languages: ru_ru

source: Class TBlock constructor error:Invalid expression
ru_ru: Класс TBlock ошибка создания:кривое выражение

source: Beginning of file
ru_ru: Начало файла

source: End of file
ru_ru: Конец файла

source: Record in use, Please, retry
ru_ru: Запись занята, повторите

source: Can~t lock dataBase ! Please try again
ru_ru: Не могу заблокировать dataBase! Пожалуйста попробуйте снова

source: Called Error:
ru_ru: Ошибка вызова:

source: Field not found in dictonary
ru_ru: Поле не найдено в словаре

source: Index not found in dictonary
ru_ru: Индекс не найден в словаре

source: Line
ru_ru: Строка

source: String;
ru_ru: Строка;

source: ;not found!
ru_ru: ;не найдена!

source: &File
ru_ru: &Файл

source: E&xit
ru_ru: &Выход

source: End of application
ru_ru: Завершить работу

source: &Options
ru_ru: &Опции

source: &Find
ru_ru: &Найти

source: Find string
ru_ru: Поиск строки

source: &Resume
ru_ru: &Продолжить

source: Resume find string
ru_ru: Продолжить поиск строки

source: &Unmark
ru_ru: Сн&ять отметку

source: Unmark selected block
ru_ru: Снять отметку блока

source: Y
ru_ru: Д

source: array
ru_ru: массив

source: Block
ru_ru: Блок

source: Yes
ru_ru: Да

source: No
ru_ru: Нет

source: Object
ru_ru: Объект

source: N
ru_ru: Н

source: Connect not activated
ru_ru: Связь не установлена

source: Find & replace
ru_ru: Поиск и замена

source: Find:
ru_ru: Найти:

source: Replace:
ru_ru: Заменить:

source: Find
ru_ru: Поиск

source: Options
ru_ru: Опции

source: Case-sensitive
ru_ru: Учитывать регистр

source: Word only
ru_ru: Только слово

source: Reg. expression
ru_ru: Рег.выражение

source: All windows
ru_ru: Во всех окнах

source: Forward
ru_ru: Вперед

source: Backward
ru_ru: Назад

source: From begin
ru_ru: От начала

source: Direction
ru_ru: Направление

source: Global
ru_ru: В тексте

source: In block
ru_ru: В блоке

source: Where
ru_ru: Где

source: Out from bound in sorted array
ru_ru: Выход за границы сортированного массива

source: Unknown values for key or data
ru_ru: Неизвестно значение ключа или данных

source: Out bounds in sorted array
ru_ru: Выход за границы сортированного массива

source: Key value not found in sorted array
ru_ru: Значение ключа не найдено в сортированном массиве

source: Unknown values for key
ru_ru: Неизвестно значение ключа или данных

source: : create error:
ru_ru: : ошибка создания:

source: : open error:
ru_ru: : ошибка открытия:

source: Bad string in .ini file:
ru_ru: Неправильная строка в .ini файле

source: Error A2EDIT; What~s Edit ?
ru_ru: Ошибка A2EDIT; Чего редактировать ?

source: <bof>
ru_ru: <начало>

source: <new>
ru_ru: <новая>

source: Record N
ru_ru: Запись N

source: January
ru_ru: Январь

source: February
ru_ru: Февраль

source: March
ru_ru: Март

source: April
ru_ru: Апрель

source: May
ru_ru: Май

source: June
ru_ru: Июнь

source: July
ru_ru: Июль

source: August
ru_ru: Август

source: September
ru_ru: Сентябрь

source: October
ru_ru: Октябрь

source: November
ru_ru: Ноябрь

source: December
ru_ru: Декабрь

source: Sunday
ru_ru: Воскресенье

source: Monday
ru_ru: Понедельник

source: Tuesday
ru_ru: Вторник

source: Wednesday
ru_ru: Среда

source: Thursday
ru_ru: Четверг

source: Friday
ru_ru: Пятница

source: Saturday
ru_ru: Суббота

source: Can't open;
ru_ru: Невозможно открыть;

source: Database files
ru_ru: Файлы баз данных

source: # records
ru_ru: # записей

source: last update
ru_ru: изменен

source: size
ru_ru: размер

source: Esc: Cancel
ru_ru: Прервать

source: <Ins>
ru_ru: <Вст>

source: <Ovr>
ru_ru: <Зам>

source: Invalid argument
ru_ru: Плохой аргумент

source: Database Files # Records Last Update Size
ru_ru: Файлы БД # Записей Дата изм. Размер

source: Do you want more samples?
ru_ru: Хотите еще примеров ?

source: Page No.
ru_ru: Стр.No.

source: ** Subtotal **
ru_ru: ** итого **

source: * Subsubtotal *
ru_ru: * всего *

source: *** Total ***
ru_ru: *** итого ***

source: Ins
ru_ru: Вст

source: Invalid date
ru_ru: Плохая дата

source: Range:
ru_ru: Предел:

source: YyTtYy1
ru_ru: YyTtДд1

source: NnFfNn0
ru_ru: NnFfНн0

source: Unknown
ru_ru: Неизвестен

source: Memo
ru_ru: Текст

source: Undef
ru_ru: Неопределен

source: Where are you going?
ru_ru: Куда пойдем?

source: &Control
ru_ru: &Управление

source: &Next
ru_ru: &Дальше

source: Go next item
ru_ru: Перейти на след. объект

source: &Prev
ru_ru: &Назад

source: Go previous item
ru_ru: Перейти на пред. объект

source: P&revUrl
ru_ru: Пред. документ

source: Go previous URL document
ru_ru: Загрузить пред. документ

source: Nex&tUrl
ru_ru: След. документ

source: Go next URL document
ru_ru: Загрузить след. документ

source: &InfoUrl
ru_ru: Информация

source: Get information about URL document
ru_ru: Информация о URL

source: <eof>
ru_ru: <конец>

source: <empty>
ru_ru: <пусто>

source: Press any key to continue
ru_ru: Нажмите любую клавишу

source: View printer output in text editor
ru_ru: Просмотр в текстовом редакторе

source: Printing to main printer on your host
ru_ru: Печать на главном принтере

source: choice printer
ru_ru: Выберите принтер

source: : Printing pages range: from XXXX to YYYY
ru_ru: : Печать страниц с XXXX до YYYY

source: : Printing copies: XXXX
ru_ru: : Кол-во копий: XXXX

source: Printbegin(): printing already in process
ru_ru: Printbegin(): печать уже активизирована

source: PrintEnd(): printing process not actived
ru_ru: PrintEnd(): печать еше не активизирована

source: Press any key
ru_ru: Нажмите любую клавишу

source: ESC -menu
ru_ru: ESC - меню

source: Can't open file;
ru_ru: Не могу открыть файл;

source: File;
ru_ru: Файл;

source: ;not saved. Save it?
ru_ru: ;не сохранен. Сохранить?

source: No
ru_ru: Нет

source: Cancel
ru_ru: Прервать

source: Made
ru_ru: Произведено

source: changes
ru_ru: изменений

source: Nothing to find!!!
ru_ru: А искать-то - нечего!!!

source: String
ru_ru: Строка

source: not found!
ru_ru: не найдена!

source: There is a change in the file.;
ru_ru: Файл был изменен.;

source: ; Reload?
ru_ru: ; Перечитать?

source: Symbol '
ru_ru: Символ '

source: ' not found!
ru_ru: ' не найден!

source: Structure not found!
ru_ru: Структура не найдена!

source: Block not marked!
ru_ru: Блок не отмечен!

source: ;already exists. Overwrite it?
ru_ru: ;уже существует. Переписать?

source: Windows list
ru_ru: Список окон

source: ESC - menu <SINGLE GRAPHIC>
ru_ru: ESC - меню <SINGLE GRAPHIC>

source: ESC - menu
ru_ru: ESC - меню

source: ESC - menu <DOUBLE GRAPHIC>
ru_ru: ESC - меню <DOUBLE GRAPHIC>

source: <R>
ru_ru: <Ч>

source: <Link>
ru_ru: <Связь>

source: I
ru_ru: В

source: O
ru_ru: З

source: &New
ru_ru: &Новый

source: Create a new file
ru_ru: Создать новый файл

source: &Open...
ru_ru: &Открыть ...

source: Open a file
ru_ru: Открыть файл

source: &Save
ru_ru: &Сохранить

source: Save a file
ru_ru: Записать файл на диск

source: &Save as...
ru_ru: &Сохранить

source: Save a file as...
ru_ru: Сохранение файла...

source: &Reload file
ru_ru: &Перечитать

source: Reload a file
ru_ru: Перечитать файл

source: Read on&ly
ru_ru: Только &чтение

source: Read only options
ru_ru: Включить/выключить режим Только Чтение

source: &Print...
ru_ru: Печа&ть...

source: Print a file
ru_ru: Печать файла

source: Print &block...
ru_ru: Печа&ть блока...

source: Print marked block
ru_ru: Печа&ть блока...

source: E&xit with save
ru_ru: Выход с со&хранением

source: End of application and save options
ru_ru: Завершить работу и сохранить текущие установки

source: Exit with-out sa&ve
ru_ru: Выйти &без сохранения

source: End of application and not save options
ru_ru: Завершить работу без сохранения текущих установок

source: &Window
ru_ru: &Окно

source: &List
ru_ru: &Список

source: List of windows
ru_ru: Список открытых окон

source: &Next
ru_ru: С&ледующее

source: Next window
ru_ru: Следующее окно

source: &Prev
ru_ru: &Предыдущее

source: Prevoice window
ru_ru: Предыдущее окно

source: &Close
ru_ru: &Закрыть

source: Close window
ru_ru: Закрыть окно

source: &Block
ru_ru: &Блок

source: &Line block marker
ru_ru: &Строчный блок

source: Start/stop line block marker
ru_ru: Начать/закончить отметку строчного блока

source: &Column block marker
ru_ru: &Прямоугольный блок

source: Start/stop columns block marker
ru_ru: Начать/закончить отметку прямоугольного блока

source: &Unmark
ru_ru: Сн&ять

source: Unmark block marker
ru_ru: Снять отметку блока

source: Co&py
ru_ru: &Копировать

source: Copy block
ru_ru: Копировать блок

source: &Move
ru_ru: Пе&реместить

source: Move block
ru_ru: Переместить блок

source: &Delete
ru_ru: &Удалить

source: Delete block
ru_ru: Удалить блок

source: Copy to clip&board
ru_ru: Копировать в &буфер

source: Copy block to clipboard
ru_ru: Скопировать блок в буфер

source: Pa&ste from clipboard
ru_ru: Вставить из бу&фера

source: Paste block from clipboard
ru_ru: Вставить блок из буфера

source: &Save to file
ru_ru: &Записать в файл

source: Save block to file
ru_ru: Записать выделенный блок в файл

source: &Load from file
ru_ru: П&рочитать из файла

source: Load block from file
ru_ru: Прочитать блок из файла

source: &Service
ru_ru: &Сервис

source: &Insert mode
ru_ru: &Режим вставки

source: On/off insert mode
ru_ru: Вкл/выкл режим вставки

source: Find &string
ru_ru: &Поиск строки

source: Find string
ru_ru: Поиск строки

source: Find &next
ru_ru: Найти &следующее

source: Find next
ru_ru: Найти следующее вхождение подстроки

source: Find pre&vious
ru_ru: Найти пре&дыдущее

source: Find previous
ru_ru: П&родолжить поиск

source: &Replace
ru_ru: &Заменить

source: Find and replace string
ru_ru: Найти подстроку и заменить

source: &Match symbol forward
ru_ru: Поиск &символа вперед

source: Match identity symbol in forward
ru_ru: Поиск похожего символа вперед по тексту

source: Match symbol &backward
ru_ru: Поиск си&мвола назад

source: Match identity symbol in backward
ru_ru: Поиск похожего символа в обратном направлении

source: Match structure forward
ru_ru: По&иск структуры

source: Match Clipper structure to forward
ru_ru: Поиск структуры по правилам Clipper вперед

source: Match structure backward
ru_ru: Поиск структуры &назад

source: Match Clipper structure to backward
ru_ru: Поиск структуры по правилам Clipper назад

source: &Undo
ru_ru: О&ткат

source: Undo operation
ru_ru: Операция отката

source: Format &line
ru_ru: Ф&ормат строка

source: Format line
ru_ru: Форматирование строки

source: Format &part
ru_ru: Формат абза&ц

source: Format part
ru_ru: Форматирование абзаца

source: O&therwise
ru_ru: П&рочее

source: &Template
ru_ru: &Шаблон

source: Template
ru_ru: Вставить строку по шаблону

source: Template &macro
ru_ru: &Макроподстановка

source: Template macro
ru_ru: Выполнить макроподстановку

source: &Single graphic
ru_ru: &Графика одиночная

source: On/Off single graphic mode
ru_ru: Вкл/выкл режим рисования одиночных линий

source: &Double graphic
ru_ru: Графика &двойная

source: On/Off double graphic mode
ru_ru: Вкл/выкл режим рисования двойных линий

source: &Choose code page
ru_ru: &Выбрать кодировку

source: Choose code page
ru_ru: Выбрать кодировку

source: &Options...
ru_ru: Оп&ции...

source: Set options
ru_ru: Настройка

source: R:
ru_ru: Ч:

source: ; not saved. Save?
ru_ru: ; не сохранен. Сохранить?

source: Options
ru_ru: Опции

source: Create .bak files
ru_ru: Создавать .bak файлы

source: Tabulation size
ru_ru: Шаг табуляции

source: current directory
ru_ru: текущей директории

source: last directory
ru_ru: последней директории

source: Autosave files
ru_ru: Автосохранение

source: Autosave time
ru_ru: Время автосохр.

source: Save status
ru_ru: Сохранять статус

source: Hypen in word
ru_ru: Перенос в словах

source: Auto wrap
ru_ru: Автоперенос

source: Auto margin left
ru_ru: Автоматич. установка левой границы

source: Margin left
ru_ru: Левая граница

source: Margin right
ru_ru: Правая граница

source: Line
ru_ru: Строка

source: Bad line number!
ru_ru: Не правильно указан номер строки!

source: New
ru_ru: Новый

source: Link
ru_ru: Связь

source: Source charset
ru_ru: Исходная кодировка

source: Load file...
ru_ru: Чтение файла...

source: The size of file ;
ru_ru: Размер файла ;

source: OK
ru_ru: ОК

source: Save file...
ru_ru: Сохранение файла...

source: Can't create ;
ru_ru: Не возможно создать ;

source: .bak file
ru_ru: .bak файл

source: Save block to file...
ru_ru: Запись блока в файл...

source: cp437
ru_ru: cp866
