Repository: clip-itk/clip-itk
Catalog: clip/locale.po/*/cliprt.po
Languages: pt_br

source: Open error
pt_br: erro de abertura

source: Bad alias
pt_br: Alias inválido

source: No such field
pt_br: Não existe o campo

source: Workarea not in use
pt_br: Area de trabalho inativa

source: No alias
pt_br: Não tem alias

source: No controlling order
pt_br: Não tem controle de ordem

source: Bad FOR expression
pt_br: Expressão FOR inválida

source: No driver linked: %s
pt_br: Driver não referenciado: %s

source: no namespace %lx
pt_br: Não existe reserva de espaço para o nome %lx

source: no namespace var %lx
pt_br: Não existe reserva de espaço para a variável de nome %lx

source: Alias already in use: %s
pt_br: Alias %s já está em uso

source: got debug signal %d
pt_br: debug: obtido sinal de depuração %d

source: debug: cannot open debug input '%s': %s
pt_br: debug: não foi possível abrir a entrada de depuração '%s': %s

source: debug: cannot open debug output '%s': %s
pt_br: debug: não foi possível abrir a saída de depuração '%s': %s

source: sigint: file %s line %d proc %s
pt_br: sigint: arquivo %s linha %d proc %s

source: dbg read cmd: %s
pt_br: ler dbg cmd: %s

source: breakpoint reached: file %s line %d proc %s
pt_br: marca de parada: arquivo %s linha %d proc %s

source: watchpoint reached: expr '%s' file %s line %d proc %s
pt_br: marca de parada: expr '%s' arquivo %s linha %d proc %s

source: process dbg cmd: '%s'
pt_br: processar dbg cmd: '%s'

source: find dbg cmd: '%s', %d argc
pt_br: buscar dbg cmd: '%s', %d argc

source: end cmd: '%s'
pt_br: fim de cmd: '%s'

source: init screen: %s
pt_br: inicializando tela: %s

source: exit
pt_br: saída

source: start
pt_br: início

source: process LANG environ '%s/%s'
pt_br: processando ambiente LANG '%s/%s'

source: process CHARSET environ '%s/%s'
pt_br: processando ambiente CHARSET '%s/%s'

source: process TERM environ '%s/%s'
pt_br: processando ambiente TERM %s/%s

source: load charset tables '%s'
pt_br: carregando tabelas de caracteres '%s'

source: set stream io translation %s -> %s
pt_br: marca de tradução de fluxo de e/s %s -> %s

source: cannot load charset file '%s': %s
pt_br: não foi possível carregar arquivo de caracteres '%s': %s

source: CLIP VM debug signal %d #%d
pt_br: CLIP VM: sinal de depuração %d

source: got signal %s, exiting...
pt_br: ocorreu sinal %s, terminando...

source: trace: file '%s' line %d
pt_br: triagem: arquivo '%s' linha %d

source: C call: proc '%s' file '%s' line %d
pt_br: chamada C: proc '%s' arquivo '%s' linha %d

source: %s: systerm errorblock: runtime error: %s
pt_br: %s: errorblock do sistema: erro de execução: %s

source: trace: %s
pt_br: triagem: %s

source: %s: errorblock nested too deep (%d):
pt_br: %s: errorblock bastante profundo (%d):

source: C call from: proc '%s' file '%s' line %d
pt_br: chamada C a partir de: proc '%s' arquivo '%s' linha %d

source: C return=%d to: proc '%s' file '%s' line %d
pt_br: C retorna=%d para: proc '%s' arquivo '%s' linha %d

source: clip_eval: non-code argument
pt_br: clip_eval: argumento no-code

source: call by name not from CHARACTER_t or NUMERIC_t value
pt_br: chamada por nome não vem de valor de CHARACTER_t ou NUMERIC_t

source: non-logical type in NOT operator
pt_br: tipo não lógico no operador 'NOT'

source: non-numeric type in MINUS operator
pt_br: tipo não numérico no operador 'MINUS'

source: macro assign with non-character argument (%s)
pt_br: acionada macro com argumento não caracter (%s)

source: no variable name: '%.*s'
pt_br: sem nome de variável '%.*s'

source: non-logical var in condition
pt_br: variável não lógica na condição

source: no memvar variable '%s'
pt_br: não tem variável de memória '%s'

source: no variable '%s'
pt_br: não tem variável '%s'

source: try access to unknown public var '%s'
pt_br: tentando acessar variável pública desconhecida '%s'

source: invalid arguments for '%s' operation
pt_br: argumentos inválidos para operação '%s'

source: invalid arguments
pt_br: argumentos inválidos

source: adel for non-array object
pt_br: usado ADEL para uma nariável que não é matriz

source: index for adel is out-of range: ind=%d, count=%d
pt_br: índice para ADEL fora da escala determinada: ind=%d, cont=%d

source: asize for non-array object
pt_br: ASIZE para uma nariável que não é matriz

source: index for asize is out-of range: ind=%d, count=%d
pt_br: índice para ASIZE fora da escala determinada: ind=%d, cont=%d

source: ains for non-array object
pt_br: AINS para uma nariável que não é matriz

source: index for ains is out-of range: ind=%d, count=%d
pt_br: índice para AINS fora da escala determinada: ind=%d, cont=%d

source: aget for non-array object
pt_br: AGET para uma nariável que não é matriz

source: index for aget is out-of range: ind=%d, count=%d
pt_br: índice para AGET fora da escala determinada: ind=%d, cont=%d

source: aset for non-array object
pt_br: ASET para uma nariável que não é matriz

source: index for aset is out-of range: ind=%d, count=%d
pt_br: índice para ASET fora da escala determinada: ind=%d, cont=%d

source: madd for non-map object
pt_br: MADD usado para objeto non-map

source: mdel for non-map object
pt_br: MDEL usado para objeto non-map

source: mind for non-map object
pt_br: MIND usado para objeto non-map

source: try fetch element from non-array object%s%s
pt_br: tentando obter elemento de objeto que não é matriz %s%s

source: map fetch error: index %s
pt_br: erro de função map: índice %s

source: out-of-bounds array %s, index=%d, count=%d
pt_br: fora de límites, matriz %s, índice=%d, cont=%d

source: map/array fetch error
pt_br: erro obtendo map/matriz

source: undefined macro-variable in string
pt_br: variável macro indefinida em texto (string)

source: non-character result of macro in string
pt_br: encontrado não caracter como resultado de macro em texto (string)

source: macro operation with non-character argument (%s)
pt_br: operação de macro com argumento não caracter (%s)

source: no method %s
pt_br: não tem método %s

source: method %s is not code
pt_br: método %s não é código

source: invalid type in INCR/DECR operation
pt_br: tipo inválido en operação INCR/DECR

source: %s: runtime error: %s
pt_br: %s: erro de execução: %s

source: unknown error
pt_br: erro desconhecido

source: invalid argument
pt_br: argumento inválido

source: bound error
pt_br: erro de límite

source: string too long
pt_br: texto muito longo

source: number too big
pt_br: número muito grande

source: divide by zero
pt_br: divisão por cero

source: number error
pt_br: erro de número

source: syntax error
pt_br: erro de sintaxe

source: syntax too complex
pt_br: sintaxe muito complexa

source: memory error
pt_br: erro de memoria

source: no function
pt_br: não tem função

source: no method
pt_br: não tem método

source: no variable
pt_br: não tem variável

source: no alias
pt_br: não tem alias

source: no varmethod
pt_br: não tem método de variável (varmethod)

source: create error
pt_br: erro de criação

source: open error
pt_br: erro de abertura

source: close error
pt_br: erro de fechamento

source: read error
pt_br: erro de leitura

source: write error
pt_br: erro de gravação

source: print error
pt_br: erro de impresão

source: unsupported
pt_br: não suportado

source: limit exhaust
pt_br: límite atingido

source: corruption detected
pt_br: detectada corrupção

source: wrong datatype
pt_br: tipo de dados errado

source: wrong datawidth
pt_br: erro de tamanho de dados

source: no table
pt_br: não tem tabela

source: no order
pt_br: não tem ordem

source: share violation
pt_br: violação de compartilhamento

source: unlocked
pt_br: desbloqueado

source: readonly
pt_br: somente leitura

source: appendlock
pt_br: bloqueio para adicionar (appendblock)

source: bad alias
pt_br: alias inválido

source: locking error
pt_br: Error de bloqueio

source: system signal
pt_br: sinal do sistema

source: macro reference with non-character argument (%s)
pt_br: referencia a macro con argumento não-caracter (%s)

source: translate_charset: cannot load charset file '%s': %s
pt_br: translate_charset: não pode ser carregado a definição de caracteres '%s': %s

source: stack check failed at line %d file %d
pt_br: erro de teste de pilha na linha %d do arquivo %d

source: cannot stat file '%s': %s
pt_br: não encontrado o arquivo de stat '%s': %s

source: is not regular file '%s'
pt_br: '%s'não é um arquivo regular

source: is not pobj file '%s'
pt_br: '%s' não é um arquivo de pobj

source: open file '%s' error: %s
pt_br: abrindo arquivo '%s' deu erro: %s

source: mmap file '%s' error: %s
pt_br: mmap no arquivo '%s' deu erro: %s

source: read file '%s' error: %s
pt_br: leitura do arquivo '%s' deu erro: %s

source: '%s' is not valid pobj file: invalid magic
pt_br: '%s' não é um arquivo pobj válido: identificação inválida

source: shared loading problem: %s: file %s
pt_br: problema de carga compartilhada %s: arquivo %s

source: shared '%s' fetch name '%s' problem: %s
pt_br: compartilhamento '%s' obtenção de '%s' problema: %s

source: unknown file type: '%s'
pt_br: tipo de arquivo desconhecido: '%s'

source: cannot load file: '%s'
pt_br: não pode carregar o arquivo: '%s'

source: PCODE call from: proc '%s' file '%s' line %d
pt_br: chamada PCODE a partir de: proc '%s' arquivo '%s' linha %d

source: PCODE return=%d to: proc '%s' file '%s' line %d
pt_br: PCODE retorna=%d para: proc '%s' arquivo '%s' linha %d

source: PCODE call: proc '%s' file '%s' line %d
pt_br: chamada PCODE: proc '%s' arquivo '%s' linha %d

source: invalid bytecode %d
pt_br: bytecode inválido %d

source: Cannot take io permissons: %s
pt_br: Não conseguiu permissão de i/o: %s

source: DBGCONNECT: cannot create FIFO '%s': %s
pt_br: DBGCONNECT: não pode criar FIFO '%s': %s

source: fifo %s created successfully
pt_br: FIFO %s criado com exito

source: DBGCONNECT: cannot send signal SIGUSR1 to pid %lu: %s
pt_br: DBGCONNECT: não pode enviar sinal SIGUSR1 para pid %lu: %s

source: signal SIGUSR1 sent to pid %lu
pt_br: sinal SIGUSR1 enviada para pid %lu

source: DBGCONNECT: cannot open FIFO '%s': %s
pt_br: DBGCONNECT: não pode abrir FIFO '%s': %s

source: fifo %s opened for writing
pt_br: FIFO %s aberto para gravar

source: fifo %s opened for reading
pt_br: FIFO %s aberto para leitura

source: DBGCOMMAND: cannot read data
pt_br: DBGCOMMAND: não pode ler datos

source: DBGCOMMAND: no connection
pt_br: DBGCOMMAND: não tem conexão

source: DBGCOMMAND: cannot send signal to PID %lu
pt_br: DBGCOMMAND: não pode enviar sinal para PID %lu

source: add locale '%s'
pt_br: adicionada regionalização '%s'

source: localed msg: %s -> %s: %.*s -> %.*s
pt_br: mensagem regionalizada: %s -> %s: %.*s -> %.*s

source: locale msg: %s -> %s: %s
pt_br: mensagem regionalizada: %s -> %s: %s

source: locale msg plural(%ld:%lu): %s -> %s: %s
pt_br: mensagem regionalizada no plural (%ld:%lu): %s -> %s: %s

source: no access to file '%s': not a regular file
pt_br: não tem acesso ao arquivo '%s': não é um arquivo regular

source: no access to file '%s': %s
pt_br: não tem acesso ao arquivo '%s': %s

source: locale settings not found for module '%s'
pt_br: parâmetros de regionalização não encontrados no módulo '%s'

source: no access to locale file '%s': %s
pt_br: não tem acesso ao arquivo de regionalização '%s': %s

source: cannot open locale file '%s': %s
pt_br: não pode abrir arquivo de regionalização'%s': %s

source: open locale file '%s', charset '%s'
pt_br: aberto arquivo de regionalização'%s', tipo de caracteres '%s'

source: cannot stat locale file '%s': %s
pt_br: não pode acessar ao arquivo de regionalização'%s': %s

source: cannot read locale file '%s': %s
pt_br: não pode ler arquivo de regionalização'%s': %s

source: wrong magic number of locale file '%s'
pt_br: número de identificação errado do arquivo de regionalização'%s'

source: illegal revision of locale file '%s': %d
pt_br: revisão ilegal do arquivo de regionalização'%s': %d

source: runtime codeblock compiler: '%.*s': %s
pt_br: compilador de bloco de código para execução: '%.*s': %s

source: close printer:%s
pt_br: fechando impresora: %s

source: set print to:%s,%s
pt_br: definindo impressora para: %s,%s

source: cannot open printer file '%s': %s
pt_br: não pode abrir arquivo de impresora '%s': %s

source: set printer translation %s -> %s
pt_br: definida tradução de impresora %s -> %s

source: task_run: cannot start function '%s'
pt_br: task_run: não pode iniciar função '%s'

source: TASK sheduler not implemented for OS %s
pt_br: manipulador de TAREFAS (TASK) não implementado para SO %s

source: BREAK function requare argument
pt_br: função BREAK requer argumento

source: PROCNAME: invalid call level '%d'
pt_br: PROCNAME: chamada inválida '%d'

source: FILENAME: invalid call level '%d'
pt_br: FILENAME: chamada inválida '%d'

source: COMPILE: non-character parameter
pt_br: COMPILE: parâmetro não-caracter

source: block2str: non-pcode parameter
pt_br: block2str: parámetro non-pcode

source: no name given
pt_br: nome não definido

source: ELF '%s' loading problem: %s
pt_br: ELF '%s' erro lendo: %s

source: Unknown data type or bad size of item
pt_br: Tipo de datos desconhecido ou tamanho inválido de item

source: Bad BTREE handle
pt_br: Módulo BTREE inválido

source: Internal error in BTREE module
pt_br: Erro interno no módulo BTREE

source: MAX_BTREE_DEEP exceeded
pt_br: MAX_BTREE_DEEP ultrapassado

source: CDX internal error: bad root page
pt_br: CDX: Erro interno: página raíz inválida

source: CDX internal error: bad leaf page
pt_br: CDX: Erro interno: página inválida

source: CDX internal error: no keys on the page
pt_br: CDX: Erro interno: não tem chaves na página

source: Bad header
pt_br: Cabecalho inválido (header)

source: No such tag
pt_br: Sem macação

source: Bad data
pt_br: Dados inválidos

source: Bad WHILE expression
pt_br: Expressão WHILE inválida

source: Bad EVAL expression
pt_br: Expressão EVAL inválida

source: Unlock error
pt_br: Erro de desbloqueio

source: Shared lock error
pt_br: Erro de bloqueio compartilhado

source: Exclusive lock error
pt_br: Erro de bloqueio exclusivo

source: Table header corrupted
pt_br: Cabeçalho de tabela corrompido

source: Bad table structure
pt_br: Estrutura de tabela inválida

source: Duplicate field name
pt_br: nome de campo duplicado

source: Operation not permitted
pt_br: Operação não permitida

source: Corruption detected
pt_br: Corrupção detectada

source: Memo file not opened
pt_br: Arquhivo Memo não aberto

source: Type mismatch
pt_br: Tipos não coincidentes

source: I/O error
pt_br: Erro de I/O

source: Index corrupted
pt_br: Indice corrompido

source: Key length is too long
pt_br: Tamanho da chave muito grande

source: Not CTX file (bad signature): %s
pt_br: Não é um arquivo CTX (asinatura inválida): %s

source: Bad RDD instance
pt_br: Erro de RDD

source: Bad filter expression
pt_br: Erro de expressão de filtro

source: Bad relation expression
pt_br: Erro de expressão de relacionamento

source: Bad field
pt_br: Campo inválido

source: No data file driver linked: %s
pt_br: Não foi lincado driver de arquivo de dados: %s

source: No index file driver linked: %s
pt_br: Não foi lincado driver de arquivo de índice: %s

source: No memo file driver linked: %s
pt_br: Não foi lincado driver de arquivo de memo: %s

source: no item DBF_CHARSET, revert to KOI charset
pt_br: Não tem item DBF_CHARSET, voltando caracteres para KOI

source: dbf: cannot determine host charset, revert to koi_locale
pt_br: dbf: não pode determinar caracteres padrão, voltando para koi_locale

source: load host charset '%s'
pt_br: carregados caracteres padrões '%s'

source: dbf: cannot load charset '%s': %s, revert to koi_locale
pt_br: dbf: não pode carregar caracteres '%s': %s, voltando para koi_locale

source: load dbf charset '%s'
pt_br: carregado caracteres dbf '%s'

source: Bad argument (2)
pt_br: Argumento inválido (2)

source: Bad filter handle
pt_br: Erro de filtro de handle

source: Invalid join type
pt_br: Tipo de união inválida (join)

source: Not memo field
pt_br: Não é campo memo

source: Create file error
pt_br: Erro de criação de arquivo

source: Open file error
pt_br: Erro de abertura de arquivo

source: File write error
pt_br: Erro de gravação de arquivo

source: File read error
pt_br: Error de leitura de arquivo

source: Bad .flt file
pt_br: Arquivo .flt inválido

source: UTF terminal detected
pt_br: Terminal UTF detectou

source: set out translation: %s -> %s
pt_br: saída da tradução: %s -> %s

source: got xterm mouse event: type=%d y=%d x=%d buttons=%d clicks=%d
pt_br: evento de mouse de xterm: tipo=%d y=%d x=%d botões=%d clicks=%d

source: got xterm rawmode mouse event: type=%d y=%d x=%d xt_buttons=%d buttons=%d clicks=%d
pt_br: evento de mouse no xterm em modo plano: tipo=%d y=%d x=%d botões_xt=%d botõs=%d clicks=%d

source: got gp_get_event: %d type=%d y=%d x=%d buttons=%d m_buttons=%d
pt_br: ocorreu gp_get_event: %d tipo=%d y=%d x=%d botõs=%d botõs_m=%d

source: Gpm_Open return %d
pt_br: Gpm_Open retorna %d
