Repository: clip-itk/clip-itk
Catalog: doc/po/doc/problems.sgml/*.po
Languages: ru

source: Possible problems and uncompatibilities
ru: Возможные проблемы и несовместимости

source: One of the most important targets of CLIP is Clipper compatibility. But when the compatibility gets in contradiction with the functionality, the latter is chosen as more important. This is the cause of the part of uncompatibilities. Cause of another part of uncompatibilities is distinction of the Unix platform (e.g. different file systems and terminal capabilities).
ru: Одним из главных приоритетов CLIP является совместимость с Clipper. Но в случаях когда совместимость входит в противоречие с функциональностью, последней отдается предпочтение. Это является причиной некоторых из несовместимостей. Причиной другого рода несовместимостей является различие между платформами DOS и Unix (например, различные файловые системы и "экранные возможности").

source: <command>SETBLINK()</command> function does not work with CLIP under Unix (it always returns .T.). When you use <emphasis>BLINK</emphasis> attribute ('*' in clipper color definition) some terminals display blinking text others highlight background. Linux console in VGA text mode blinks, in FB mode highlights background. If you are using text mode console you can use SVGATextMode program to switch VGA adapter in BG-HI mode (look at option "16color" in <emphasis>/etc/TextConfig</emphasis>). If you are using other terminal you have to find a way how to switch them into proper mode.
ru: Функция <command>SETBLINK()</command> не работает в CLIP под Unix (она всегда возвращает .T.). При использовании атрибута <emphasis>BLINK</emphasis> (символ '*' в определении цвета) некоторые терминалы показывают мигающий текст, другие - яркий фон. Консоль linux в текстовом режиме VGA мигает, в режиме окна подсвечивает фон. Если Вы используете консоль в текстовом режиме, можете воспользоваться программой SVGATextMode для переключения адаптера VGA в режим подсветки (см. опцию "16color" в <emphasis>/etc/TextConfig</emphasis>). Если Вы используете другой терминал, придется искать другой способ переключения в нужный режим.

source: Because it cannot be controlled from server side maybe you will find interesting this function:
ru: Поскольку невозможно управлять режимом подсветки со стороны сервера, может оказаться полезной следующая функция:

source: which allow to block sending <emphasis>BLINK</emphasis> attribute from a CLIP application to the terminal. So if you won't be able to set terminal in BG-HI mode you can disable using <emphasis>BLINK</emphasis> attribute (<command>blinkattr(.f.)</command>) and the text won't blink (but their background won't be highlighted too). <emphasis>Thanks for the info to Przemyslaw Czerpak.</emphasis>
ru: которая позволяет запретить передачу атрибута <emphasis>BLINK</emphasis> от приложения CLIP терминалу. Если не удается переключить терминал в режим подсветки фона, можно отключить передачу атрибута <emphasis>BLINK</emphasis> (<command>blinkattr(.f.)</command>) и текст не будет мигать (но и фон не будет подсвечиваться). <emphasis>Спасибо Przemyslaw Czerpak за информацию.</emphasis>

source: Some RDD functions (e.g. <command>DBSKIP()</command>) don't generate <emphasis>EG_NOTABLE</emphasis> error when there are no work areas in use with Clipper 5.01. But with Clipper 5.3 (and Clipper 5.2) error is generated. In such case CLIP works like Clipper 5.3.
ru: Некоторые функции RDD (например <command>DBSKIP()</command>) не генерируют ошибку <emphasis>EG_NOTABLE</emphasis> при отсутствии рабочей области в Clipper 5.01. Но при использовании Clipper 5.3 (и Clipper 5.2) ошибка генерируется. В этом случае CLIP работает как Clipper 5.3.

source: It is impossible to open a table in <command>EXCLUSIVE READONLY</command> mode with CLIP under Unix. In such case table is opened in <command>SHARED READONLY</command> mode. The cause is the difference between DOS's and Unix file locking mechanism.
ru: При использовании CLIP под Unix невозможно открыть таблицу в режиме <command>EXCLUSIVE READONLY</command>. В этом случае таблица открывается в режиме <command>SHARED READONLY</command>. Причиной этого является различие в механизмах блокировки файлов, используемых DOS и Unix.

source: <emphasis>AS</emphasis> and <emphasis>REF</emphasis> are reserved keywords in CLIP. See description of the <command>-q</command> switch in the <link linkend="compoptions">compiler options</link> section.
ru: <emphasis>AS</emphasis> и <emphasis>REF</emphasis> являются зарезервированными ключевыми словами. См. описание ключа <command>-q</command> в разделе <link linkend="compoptions">опции компилятора</link>.

source: In Clipper, <command>CHR(<![CDATA[<nConst>]]>)</command> is constant (translated at compile time). In CLIP <command>CHR()</command> is as usual function as others, it is always evaluated at run time.
ru: В Clipper <command>CHR(<![CDATA[<nConst>]]>)</command> является константой (транслируемой на этапе компиляции). В CLIP <command>CHR()</command> - обычная функция, всегда выполняемая в run-time.

source: CLIP can work in two modes: <emphasis>fullscreen</emphasis> and <emphasis>stream</emphasis>. Just started, a CLIP application is working in the <emphasis>stream</emphasis> mode, i.e. all application's output is placed in the <emphasis>stdout</emphasis> stream. An application works in this mode until any full screen operation (e.g. displaying a window, displaying data at a specified screen row and column or polling keyboard) is performed (this mode is useful for <emphasis>CGI</emphasis> applications, for example). When any full screen operation is performed, application initializes terminal, switches to <emphasis>fullscreen</emphasis> mode and stops output to the <emphasis>stdout</emphasis> stream.
ru: Приложения CLIP могут работать в двух режимах: <emphasis>полноэкранном</emphasis> и <emphasis>потоковом</emphasis>. При старте приложение CLIP работает в потоковом режиме, т.е. весь вывод направляется в поток стандартного вывода (<emphasis>stdout</emphasis>). Приложение продолжает работать в этом режиме до первой полноэкранной операции (например, показ окна, вывод данных в определенную позицию экрана или опрос клавиатуры). При этом инициализируется терминал, производится переключение в полноэкранный режим и прекращается вывод в (<emphasis>stdout</emphasis>).

source: Follow these two simple rules:
ru: Следуйте этим двум простым правилам:

source: full screen application should start with <command>CLEAR SCREEN</command> command.
ru: в начале полноэкранного приложения поставьте команду <command>CLEAR SCREEN</command> (чтобы сразу переключиться в полноэкранный режим).

source: stream application (<emphasis>CGI</emphasis>) should redefine the standard <emphasis>error block</emphasis> (by <command>ERRORBLOCK()</command> function) to avoid turning into <emphasis>fullscreen</emphasis> mode (standard <emphasis>error block</emphasis> performs full screen operations). For example:
ru: в потоковом приложении (например <emphasis>CGI</emphasis>) переопределите стандартный обработчик ошибок (функцией <command>ERRORBLOCK()</command>), чтобы избежать переключения в полноэкранный режим при возникновении ошибки (стандартный обработчик ошибок выполняет полноэкранные операции). Например:

source: In the Unix file system, file mask <emphasis>*.*</emphasis> means all files with a dot ('.') in their names. Use the <emphasis>FILE_MASK</emphasis> macro instead of '<emphasis>*.*</emphasis>'. <emphasis>FILE_MASK</emphasis> is platform dependent constant ('<emphasis>*</emphasis>' in Unix, '<emphasis>*.*</emphasis>' in Windows).
ru: В файловых системах Unix, маске файлов <emphasis>*.*</emphasis> соответствуют все файлы, содержащие точку ('.') в имени. Используйте платформо-зависимую константу <emphasis>FILE_MASK</emphasis> вместо '<emphasis>*.*</emphasis>'.

source: Do not use the keywords (<command>FIELD</command>, <command>WHILE</command>, <command>FOR</command>, <command>CASE</command>, <command>END</command>, etc) as the names of variables.
ru: Не используйте ключевых слов (<command>FIELD</command>, <command>WHILE</command>, <command>FOR</command>, <command>CASE</command>, <command>END</command>, и т.д.) в качестве имен переменных.

source: In some circumstances, the <command>IF(,,)</command> function is discerned as <command>IF ... ELSE ... ENDIF</command> statement. In such cases compiler generates a warning.
ru: При некоторых обстоятельствах функция <command>IF(,,)</command> не может быть отличена компилятором от оператора <command>IF ... ELSE ... ENDIF</command>. В таких случаях выдается предупреждающее сообщение.

source: With Clipper, the <command>TYPE()</command> function invokes some functions (e.g. <command>SUBSTR()</command>) and does not invoke anothers (e.g. <command>ALERT()</command>). CLIP does not invoke any function and returns '<emphasis>UI</emphasis>' for expressions containing any function calls.
ru: В Clipper функция <command>TYPE()</command> выполняет некоторые функции (например <command>SUBSTR()</command>), а некоторые не выполняет (например <command>ALERT()</command>). CLIP не выполняет никакие функции и возвращает '<emphasis>UI</emphasis>' для выражений, содержащих вызовы функций.

source: Clipper have an odd feature:
ru: В Clipper есть одна странная особенность:

source: This <emphasis>feature</emphasis> is <emphasis>not supported</emphasis> by CLIP (both examples are OK).
ru: Эта <emphasis>особенность</emphasis> не поддерживается в CLIP (оба примера работают).

source: Unix file system does differentiate the case of letters in the file names (<command>USE table.dbf</command> and <command>USE TABLE.DBF</command> are not equivalent commands). To help porting DOS-applications to Unix <command>SET TRANSLATE PATH ON</command> command is intended. When <command>ON</command> all file (and directory) names are translated to the lower case. In this case the full path to the file and the file itself <emphasis>must</emphasis> be in the lower case on the disk. When <command>OFF</command> the translation is not performed. In this case names of the files on the disk must correspond to the names they are addressed by.
ru: Файловые системы Unix различают регистр букв в именах файлов (<command>USE table.dbf</command> и <command>USE TABLE.DBF</command> - не равнозначные команды). Для облегчения переноса приложений из DOS в Unix существует команда <command>SET TRANSLATE PATH ON</command>. Когда <command>ON</command> все имена файлов (и директорий) переводятся в нижний регистр. В этом случае полный путь к файлу и имя самого файла на диске <emphasis>должны</emphasis> быть в нижнем регистре. Когда <command>OFF</command> перевода в нижний регистр не производится. В этом случае имена файлов на диске должны соответствовать именам, по которым к ним обращаются.

source: Disk names (C:, D:, etc) can be assigned to the directories in the following manner:
ru: Имена дисков (C:, D:, и т.д.) могут быть назначены директориям следующим способом:

source: By default, disk C: is assigned to the root directory (/).
ru: По умолчанию имя диска C: назначено корневой директории (/).

source: The <command>INDEXEXT()</command> function returns the index's suffix in the lower case.
ru: Функция <command>INDEXEXT()</command> возвращает расширение индекса в нижнем регистре.

source: Displaying of double pseudographic symbols is not possible on some types of terminals. It is possible by using <emphasis>termcap</emphasis> instead of <emphasis>terminfo</emphasis> (export TERMCAP=/etc/termcap and look at <emphasis>g1</emphasis> entry for single graphic chars and <emphasis>g2</emphasis> entry for double graphic chars in <emphasis>/etc/termcap</emphasis>).
ru: Вывод двойной псевдографики невозможен на некоторых терминалах. Это возможно при использовании описателя терминала<emphasis>termcap</emphasis> вместо <emphasis>terminfo</emphasis> (установите переменную окружения TERMCAP=/etc/termcap и см. вхождение <emphasis>g1</emphasis> для символов одинарной псевдографики и <emphasis>g2</emphasis> для символов двойной псевдографики в файле <emphasis>/etc/termcap</emphasis>).

source: Displaying of the chars with codes less than 32 is impossible on Unix terminals. These chars are displayed as highlighted char with the code <emphasis><![CDATA[<nSymbol>]]> + 32</emphasis>.
ru: Вывод символов с кодами меньше 32 невозможен на терминалах Unix. Эти символы отображаются в виде подсвеченных символов с кодами<emphasis><![CDATA[<nSymbol>]]> + 32</emphasis>.

source: The restriction of the function/procedure name size of 10 chars has been removed. It applies equally to variable names. To simplify the transition to a length of more than 10 symbols, you can use <command>#xdefine</command> directive (case-insensitive <command>#define</command>).
ru: Отсутствует ограничение длины имен функций/процедур в 10 символов. Для обегчения переноса приложений можно воспользоваться директивой <command>#xdefine</command> (нечувствительный к регистру аналог <command>#define</command>).

source: The restriction of the string size of 64k has been removed.
ru: Отсутствует ограничение длин строк в 64K.

source: The restriction of the array size of 4096/8192 elements has been removed.
ru: Отсутствует ограничение размера массивов в 4096/8192 элементов.

source: The <command>MEMOEDIT()</command> function is based on the <command>TEXTEDIT</command> class, and there may be some problems with user functions for <command>MEMOEDIT()</command>.
ru: Функция <command>MEMOEDIT()</command> основана на классе <command>TEXTEDIT</command> и могут быть некоторые проблемы с пользовательскими функциями для <command>MEMOEDIT()</command>.

source: get:baddate() is a method, not an attribute.
ru: get:baddate() - метод, а не атрибут.

source: <command>TBrowse</command> object is visualised not quite so as a standard one is, which eliminates problems with number of displayed fields and cursor positioning, when navigating over the table in user functions.
ru: Визуализация объектов <command>TBrowse</command> отличается от стандартного, зато снимаются некоторые проблемы связанные с определением количества отображаемых столбцов и позиционированием курсора в пользовательских функциях.

source: <command>RUN</command> command output damages current screen contents. When outputting to the terminal, this problem cannot be completely solved without resorting to tricks, as it turns out that several programs output independently to one device, in the same way as if several programs, independent of each other, output information to one COM port. We recommend to use something like:
ru: Вывод команды <command>RUN</command> портит текущее содержимое экрана. При выводе на терминал эта проблема не может быть полностью решена без некоторых ухтщрений. Рекомендуем использовать что-то подобное:

source: And one more peculiarity of the <command>RUN</command> command - in Unux, it runs the shell, then shell executes the program. Though <command>run cd mydir</command> will operate, but after exiting from the shell the current directory will remain the same.
ru: И еще одна особенность использования команды <command>RUN</command> - в Unix она запускает командный интерпретатор (shell), который, в свою очередь, запускает нужную программу. Хотя <command>run cd mydir</command> и сработает, но при выходе из shell текущая директория останется той же, что и была раньше.

source: In error object, there is some incompatibility.
ru: Имеются некоторые несовместимости в объектах <command>Error</command>.

source: It is preferable to use <command>inkey(0.1)</command> instead of <command>inkey()</command>, otherwise an application will use too much of processor time. In particular, we had to make some changes in DBU concerning <command>INKEY()</command> and stabilization in <command>TBrowse</command>; these changes are enclosed by <command>#ifdef __CLIP__</command>.
ru: Рекомендуется использовать <command>inkey(0.1)</command> вместо <command>inkey()</command>, иначе приложение будет занимать слишком много процессорного времени. В частности, пришлось сдлеать некоторые изменения в DBU касающиеся <command>INKEY()</command> и стабилизации объектов <command>TBrowse</command>; эти изменения изолированы директивами <command>#ifdef __CLIP__</command>.

source: <command>RESTORE FROM</command> always operates as with <command>ADDITIVE</command>.
ru: <command>RESTORE FROM</command> всегда работает в режиме <command>ADDITIVE</command>.

source: The <command>SETCOLOR()</command> function have 10 pair colors, new 5 pair don`t have any special meaning.
ru: Функция <command>SETCOLOR()</command> оперирует 10-ю парами цветов; дополнительные 5 пар не имеют какого-то специального предназначения и введены для удобства.
