Repository: clip-itk/clip-itk
Catalog: doc/po/doc/about.sgml/*.po
Languages: ru

source: Clipper compatible compiler
ru: Совместимый с Клиппер компилятор

source: Preprocessor
ru: Препроцессор

source: Fully compatible with CA-Clipper with some
ru: Полностью совместимый с CA-Clipper c некоторыми

source: new possibilities.
ru: новыми возможностями

source: Compiler
ru: Компилятор

source: Very fast and efficient OO-model
ru: Очень быстрая ОО-модель

source: <emphasis>It is possible to write programs on CLIP, without using other syntax excepting OOP.</emphasis>
ru: На CLIP можно писать программы, не применяя другого синтаксиса кроме ОО-ориентированного.

source: Initial support syntax from FS,CAVO,FoxPro.
ru: Частично поддерживается синтаксис FS,CAVO,FoxPro.

source: has much more possibilities than CA-Clipper.
ru: предоставляет намного больше возможностей чем в CA-Clipper.

source: Full international support
ru: Полная интернационализация на любой язык

source: GUI, based on GTK
ru: GUI на основе GTK

source: Provides using of all widgets and processing the events
ru: Обеспечивает полноценный доступ ко всем виджетам и обработку событий. Работает на многих платформах.

source: Using of dynamic libraries,
ru: Подключение динамических библиотек,

source: loading and execution of the byte-code from external files ( in run-time, too ).
ru: загрузка и выполнение байт-кода из внешних файлов, в том числе и во время исполнения. Загрузка DLL,SO, написаные на clipper/clip.

source: Compatibility
ru: Совместимость

source: up to <emphasis>Clipper 5.3 </emphasis> (support of objects <emphasis>menu, button, check</emphasis> and other <emphasis>get-objects</emphasis>), as well as standard classes <emphasis>tbrowse,get,error</emphasis>.
ru: до <emphasis>Clipper 5.3 </emphasis> (поддержка объектов <emphasis>menu, button, check</emphasis> и других <emphasis>get</emphasis>-объектов), а также стандартные классы <emphasis>tbrowse,get,error</emphasis>.

source: Are implemented a lot of CA_Tools functions, including all functions for processing the lines, dates, files, mathematicians.
ru: Не полная с библиотекой Ca-Tools, но сделано очень многое в том числе все функции для обработки строк, дат, файлов, математики.

source: support all SIX functions and features
ru: полностью поддерживаются все SIX-функции и фенечки

source: VFP data types: datetime,currency
ru: Типы данных VFP: datetime,currency

source: RDD allows to use your own drivers, as well as use a driver, combined from several different drivers.
ru: RDD позволяет назначать свои драйвера форматов, а также можно назначать драйвера из нескольких разных форматов.

source: RDD also allows to use only OO-style, without using of aliases
ru: RDD позволяет использовать только ОО-стиль без использования механизма alias'ов

source: Multitask support
ru: Поддержка многозадачности

source: Builtin simple non-preemptive multitask model
ru: Встроенная простая невытесняющая многозадачность.

source: libraries and classes for direct access to SQL-servers (PG,MySql,Oracle,Interbase)
ru: библиотеки и классы прямого доступа к SQL-серверам (PG,MySql,Oracle,Interbase)

source: ODBC and ODBC bridge to Windows drivers.
ru: ODBC и ODBC мост к Windows драйверам

source: SQL-interpreter and commands, compatible with FoxPro
ru: SQL-интерпретатор и команды совместимые с FoxPro

source: Other possibilities
ru: Другие возможности

source: Overloading operators for objects.
ru: перегрузка операций для объектов

source: Support of regular expressions.
ru: поддержка регулярных выражений;

source: function for TCP/IP sockets connections
ru: функции соединения с TCP/IP sockets;

source: COM_() functions
ru: COM_() функции

source: Rushmore like technology, but more fast and efficient.
ru: более быстрый аналог технологии "rushmore" из системы FoxPro;

source: Support of very-large-scale numbers with unlimited accuracy.
ru: поддержка больших и сверхбольших чисел с неограниченной точностью;

source: Support of graphic files PNG,GD,JPEG and primitives like lines, rectangles, firing ranges, circumferences etc.
ru: Работа с графическими файлами PNG, GD, JPEG и примитивами типа линий, прямоугольников, полигонов, окружностей и т.п.

source: Several common classes for word processorses, <emphasis>html/cgi </emphasis>programms.
ru: Несколько общеупотребительных классов для облегчения программирования текстовых процессоров, <emphasis>html/cgi </emphasis> программ.

source: Several utilities for interpreting the patterns of the documents, <emphasis>www_sql,clip_bl, clip_blank, clip_sql, clip_hindex, clip_hseek</emphasis> etc.
ru: Несколько утилит по интерпретации шаблонов документов <emphasis>www_sql, clip_bl,clip_blank, clip_sql, clip_hindex, clip_hseek</emphasis> и т.п.n

source: multiwindows interactive debugger.
ru: многооконный интерактивный отладчик.

source: Supported OS'es
ru: Операционные системы

source: TODO list
ru: Находятся в разработке

source: Windows support
ru: Версия для Windows;

source: FiveWin compatiblies.
ru: совместимость с FiveWin

source: FoxPro compatiblies.
ru: совместимость с FoxPro.
