Repository: clip-itk/clip-itk
Catalog: prg/locale.po/*.KOI8-R/debug.po
Languages: ru_ru

source: Exit from debugger ?
ru_ru: Закончить работу ?

source: List Windows
ru_ru: Список окон

source: Call stack
ru_ru: &Стек вызовов

source: Process List
ru_ru: Список процессов

source: Process connection OK
ru_ru: Подлючение к процессу выполнено

source: Process connection error
ru_ru: Ошибка подключения к процессу

source: File not found:
ru_ru: Файл не найден:

source: error open "
ru_ru: Ошибка открытия "

source: open editor for "
ru_ru: открыть редактор для "

source: string not found
ru_ru: Строка не найдена

source: Goto line number
ru_ru: Перейти к строке

source: error goto line: bad line number
ru_ru: ошибка: неправильный номер строки

source: Filename for saving status
ru_ru: Укажите имя файла куда сохранить текущее состояние

source: Error create file:
ru_ru: Ошибка создания файла:

source: Status saved to:
ru_ru: Состояние записано в файл:

source: Load options from file
ru_ru: Выполнить команды из файла

source: new tabulation size
ru_ru: новый размер табуляции

source: Search source files in directory
ru_ru: Путь поиска файлов с текстами программ

source: Break point list is empty
ru_ru: Список точек останова пуст

source: Trace point list is empty
ru_ru: Список точек трассировки пуст

source: Values list is empty
ru_ru: Список значений пуст

source: error:invalid parameter <filename>
ru_ru: ошибка: неправильный параметр <имя_файла>

source: error:invalid parameter <line>
ru_ru: ошибка: неправильный параметр <строка>

source: ADD
ru_ru: Добавить

source: DELETE
ru_ru: Удалить

source: break point for file "
ru_ru: точку останова для файла "

source: error:invalid parameter <expr>
ru_ru: ошибка: неправильный параметр <выражение>

source: trace point "
ru_ru: точка трассировки "

source: error:unknown command:
ru_ru: ошибка: неправильная команда:

source: error:usage "INPUT <filename>"
ru_ru: ошибка: используйте "INPUT <имя_файла>"

source: error:
ru_ru: ошибка:

source: error:usage "? <clipper macro construction>"
ru_ru: ошибка:используйте "? <clipper_выражение>"

source: error:usage "BREAKPOINT <line> <filename>"
ru_ru: ошибка:используйте "BREAKPOINT <строка> <имя_файла>"

source: error:usage "DELETE all BP|TP|WP" or "DELETE BP|TP|WP <number>"
ru_ru: ошибка:используйте "DELETE all BP|TP|WP" or "DELETE BP|TP|WP <номер>"

source: Error: unknown point type "
ru_ru: ошибка: неизвестен тип точки "

source: error: usage "RUN <system_comand>"
ru_ru: ошибка: используйте "RUN <системная_команда>"

source: error: usage "LIST BP|TP|WP"
ru_ru: ошибка: используйте "LIST BP|TP|WP"

source: NUMERATION lines status:
ru_ru: Статус нумерации строк:

source: error: usage "SPEED <timeout>", timeout in thenth of second
ru_ru: ошибка: используйте "SPEED <время_ожидания>", время в десятых секунды

source: Current animation speed:
ru_ru: текущая скорость анимации:

source: /10 second
ru_ru: /10 секунд

source: error:usage "TRACEPOINT <expr>"
ru_ru: ошибка:используйте "TRACEPOINT <выражение>"

source: error:usage "! <variable name>"
ru_ru: ошибка: используйте "! <имя_переменной>"

source: error:usage "tabsize <num>"
ru_ru: ошибка: используйте "tabsize <размер>"

source: New tabulation size:
ru_ru: Новый размер табуляции:

source: error:usage "path <directory>"
ru_ru: ошибка: используйте "path <имя_каталога>"

source: New source path:
ru_ru: Путь поиска файлов:

source: Code block trace status:
ru_ru: Кодовые блоки:

source: Preprocessor source view status:
ru_ru: Смотреть тексты препроцессора:

source: error:unknown command
ru_ru: ошибка: неизвестная команда

source: No connection !
ru_ru: Нет связи с процессом

source: Waiting signal from process.....
ru_ru: Ожидание сигнала от процесса....

source: Error sending signal to process
ru_ru: Ошибка доставки сигнала процессу

source: Call menu
ru_ru: Вызывается менюшка

source: &File
ru_ru: &Файл

source: &Open
ru_ru: &Открыть

source: Open source file to text editor
ru_ru: Загрузить файл с текстом программы

source: &Reload files
ru_ru: &Перечитать

source: Reload a file
ru_ru: Перечитать файл

source: E&xit
ru_ru: &Выход

source: Exit to OS
ru_ru: Выход в ОС

source: &Service
ru_ru: &Сервис

source: &Find
ru_ru: &Найти

source: Find string
ru_ru: найти строку

source: Find &next
ru_ru: искать &дальше

source: Find next string
ru_ru: Искать следующую строку

source: Find &prev
ru_ru: искать &назад

source: Find prev string
ru_ru: Искать предыдущую строку

source: &Goto line
ru_ru: &Перейти к строке

source: Goto string number
ru_ru: Перейти на номер строки

source: Math identity symbol in forward
ru_ru: Вычислить завершение конструкции

source: Math identity symbol in backward
ru_ru: Вычислить начало конструкции

source: &View
ru_ru: смотр&Еть

source: &Set values
ru_ru: Установки

source: View set(....) values
ru_ru: Посмотреть текущие значения функции set()

source: &Work aliases
ru_ru: &Рабочие области

source: View aliases
ru_ru: Рабочие области

source: work &Screen
ru_ru: рабочий &Экран

source: View screen of program
ru_ru: Посмотреть состояние рабочего экрана программы

source: &Call stack
ru_ru: &Стек вызовов

source: View program call stack
ru_ru: Посмотреть стек вызовов процедур и функций

source: &Break points
ru_ru: &Точки останова

source: View program break points
ru_ru: Посмотреть текущие точки останова

source: &Monitor
ru_ru: &Монитор

source: View public,private,local,static variables
ru_ru: Смотреть значения public,private,local,static переменных

source: &Run
ru_ru: &Пуск

source: &Connect process
ru_ru: &Подключится

source: Connect to external process
ru_ru: &Присоединится к внешнему процессу

source: &Step
ru_ru: &Шаг

source: Step program
ru_ru: Сделать один шаг отлаживаемой программы

source: &Go cursor
ru_ru: &До курсора

source: Run progran and stop for cursor
ru_ru: Запустить программу и остановить там где стоит курсор

source: &Trace
ru_ru: &Трассировка

source: Run progran as trace
ru_ru: Трассировка программы

source: &Run, no wait
ru_ru: &Без ожидания

source: Run progran, no wait
ru_ru: Запустить программу без остановок

source: Animation speed
ru_ru: Скорость анимации

source: Set speed for animation mode
ru_ru: Установить скорость анимации

source: &Animation
ru_ru: &Анимация

source: &Points
ru_ru: &Точки

source: &Values
ru_ru: Значения

source: Add values to view window
ru_ru: Добавить выражение в окно просмотра

source: &Trace
ru_ru: &Трассировка

source: Add trace variable
ru_ru: Добавить значение трассировки

source: &Stop
ru_ru: &Остановки

source: Stop point program
ru_ru: Установить точку останова программы

source: &Delete
ru_ru: &Удалить

source: Delete point from view window
ru_ru: Удалить точку из окна просмотра

source: &Options
ru_ru: &Режимы

source: &Proprocesor text
ru_ru: &Текст препроцессора

source: Say prerocessor text in source window
ru_ru: Включить режим просмотра текста препроцессора

source: &Number of strings
ru_ru: &Нумерация строк

source: Say number source strings
ru_ru: Включить режим просмотра нумерации строк

source: &Code blocks trace
ru_ru: &Кодовые блоки

source: Trace code blocks source
ru_ru: Включить режим отладки кодовых блоков

source: &Tab size
ru_ru: &Размер табуляции

source: Set tab size for view source
ru_ru: Установить размер шага табуляции

source: source &Path
ru_ru: путь поиска &Файлов

source: Set path for search source files
ru_ru: Установить путь для поиска файлов с исходными текстами

source: &Save options
ru_ru: &Сохранить

source: Save current options
ru_ru: Сохранить текущие установки

source: &Load Options
ru_ru: &Прочитать

source: Load saved options
ru_ru: Прочитать установки из файла

source: &Window
ru_ru: &Окна

source: &List
ru_ru: &Список

source: List of windows
ru_ru: Показать список окон

source: &Next
ru_ru: &Следующее

source: Select next window
ru_ru: Активизировать следующее окно

source: &Prev
ru_ru: &Предыдущее

source: Select prevoice window
ru_ru: Активизировать предыдущее окно

source: &Zoom
ru_ru: &Размер

source: Switch window size
ru_ru: Переключить размер окна

source: &Close
ru_ru: &Закрыть

source: Close current window
ru_ru: Закрыть текущее окно

source: Debug commands
ru_ru: Команды отладчика

source: Commands
ru_ru: Команды

source: Program source
ru_ru: Текст программы

source: Debug variables
ru_ru: Переменные отладки

source: Values
ru_ru: Значения

source: Enter a new expression:
ru_ru: Введите новое выражение:

source: View info
ru_ru: Просмотр информации

source: current settings
ru_ru: текущие установки

source: View work selects
ru_ru: Просмотр рабочих областей

source: work selects
ru_ru: Рабочие области

source: DB
ru_ru: ДБ

source: Struct
ru_ru: Структура

source: Record
ru_ru: Запись

source: Orders
ru_ru: Индексы

source: Monitor
ru_ru: Монитор

source: variable values
ru_ru: Значения переменных

source: Loading script file
ru_ru: Чтение командного файла

source: Esc-menu F1-help CtrlU-switch panels AltX-exit Alt0-list windows
ru_ru: Esc-меню F1-помощь CtrlU-переключ.панелей AltX-выход Alt0-окна
