Repository: clip-itk/clip-itk
Catalog: prg/locale.po/*.KOI8-R/udb.po
Languages: ru_ru

source: Error open dictionary list!
ru_ru: Ошибка открытия списка словарей!

source: Error open dictionaries list:
ru_ru: Ошибка открытия списка словарей:

source: Class description not found:
ru_ru: Не найден описатель класса:

source: Added(updated) object
ru_ru: Объект добавлен(обновлен)

source: Esc-menu F1-help F2-add F3-card F4-edit F8-delete F10-closeWin
ru_ru: Esc-меню F1-помощь F2-добавл. F3-карточка F4-редакт. F8-удалить F10-закрыть

source: Please fill data for query
ru_ru: Заполните форму запроса

source: Select.<classname>..
ru_ru: Выбрать.<класс>....

source: From <depository_id>
ru_ru: Из <депозитарий_id>

source: Where <expr>........
ru_ru: Что <выражение>....

source: Create new dictionary
ru_ru: Создать новый словарь

source: Choice Dictionary
ru_ru: Выбрать словарь

source: Please fill data of dictionary
ru_ru: Заполните данные о словаре

source: Ident...............
ru_ru: Идентификатор.......

source: Name................
ru_ru: Название............

source: Type................
ru_ru: Тип.................

source: Path................
ru_ru: Путь к файлам.......

source: Host name...........
ru_ru: Имя хоста...........

source: SQL port............
ru_ru: SQL порт............

source: User name...........
ru_ru: Имя пользователя....

source: SQL DB name.........
ru_ru: SQL имя БД..........

source: Choice Depository
ru_ru: Выбрать депозитарий

source: Press any key to continue
ru_ru: нажмите любую клавишу для продолжения

source: Dictionary:
ru_ru: Словарь:

source: Depository:
ru_ru: Депозитарий:

source: &Open
ru_ru: &Открыть

source: &Dictionary
ru_ru: &Словарь

source: Open CODB dictionary
ru_ru: Открыть CODB словарь

source: &Depository
ru_ru: &Депозитарий

source: Open CODB depository
ru_ru: Открыть CODB депозитарий

source: &OQL query
ru_ru: &OQL запрос

source: Open result of OQL query
ru_ru: Показать результат OQL запроса

source: E&xit
ru_ru: &Выход

source: Exit to OS
ru_ru: Завершение работы

source: &Attributes
ru_ru: &Аттрибуты

source: View and edit attributes information
ru_ru: Список и редактирование информации об аттрибутах

source: &Indexes
ru_ru: &Индексы

source: View and edit data indexes information
ru_ru: Список и редактирование информации об индексах

source: &Classes
ru_ru: &Классы

source: View and edit classes information
ru_ru: Список и редактирование информации о классах

source: &Extents
ru_ru: &Пространства

source: View and edit extents information
ru_ru: Список и редактирование информации о пространствах

source: &Plugins
ru_ru: &Модули

source: View and edit plugin information
ru_ru: Список и редактирование информации о модулях

source: &Counters
ru_ru: &Счетчики

source: View and edit data counters information
ru_ru: Список и редактирование информации о счетчиках

source: &Groups
ru_ru: &Группы

source: View and edit groups information
ru_ru: Список и редактирование информации о группах пользователей

source: &Users
ru_ru: &Пользователи

source: View and edit users information
ru_ru: Список и редактирование информации о пользователях

source: &Depositories
ru_ru: &Депозитарии

source: View and edit depositories information
ru_ru: Список и редактирование информации о депозитариях

source: &Columns
ru_ru: &Столбцы

source: View and edit columns information
ru_ru: Список и редактирование информации о столбцах

source: &Table views
ru_ru: &Таблицы

source: View and edit table views information
ru_ru: Список и редактирование информации о табличных представлениях

source: &Reports
ru_ru: &Отчеты

source: View and edit reports information
ru_ru: Список и редактирование информации об отчетах

source: &Data
ru_ru: &Данные

source: &View Objects
ru_ru: &Просмотр объектов

source: View objects in one class
ru_ru: Смотреть объекты одного класса

source: &Table view
ru_ru: &Вид таблицы

source: Choice table view
ru_ru: Выбрать вид табличного представления

source: &Order by
ru_ru: &В порядке

source: Choice data order
ru_ru: Выбрать порядок следования объектов (index)

source: &Report run
ru_ru: &Отчет

source: Choice report
ru_ru: Выбрать отчет и исполнить его

source: &Service
ru_ru: &Сервис

source: &Text Editor
ru_ru: &Редактор текста

source: Call text editor
ru_ru: Редактор текста

source: Load meta data from XML file
ru_ru: Считать данные из XML файла

source: Save meta data to XML file
ru_ru: Сохранить данные словаря в XML файл

source: Edit card not found !
ru_ru: Карточка редактирования не найдена !

source: MetaData name
ru_ru: название meta данных

source: Delete all objects, are you sure ?
ru_ru: Вы уверены, что надо удалить все объекты ?

source: Delete, are you sure ?
ru_ru: Удалить объект, вы уверены ?

source: Can`t load default plugins or plugins for subject:
ru_ru: Невозможно загрузить модуль для:

source: Choice class
ru_ru: Выберите класс

source: Esc: Cancel
ru_ru: Esc: Отказ

source: CLASS list is empty
ru_ru: Список классов пуст

source: Choice attribute
ru_ru: Выберите аттрибут

source: ATTRIBUTE list is empty
ru_ru: Список аттрибутов пуст

source: Choice index
ru_ru: Выберите индекс

source: INDEX list is empty
ru_ru: Список индексов пуст

source: TCOLUMN list is empty
ru_ru: Список столбцов пуст

source: TVIEW list is empty
ru_ru: Список представлений пуст

source: REPORT list is empty
ru_ru: Список отчетов пуст

source: Error creating file:
ru_ru: Ошибка создания файла:

source: Error writing to file:
ru_ru: Ошибка записи в файл:

source: Report:
ru_ru: Отчет:

source: Can`t display information
ru_ru: Невозможно отобразить информацию

source: Identification..
ru_ru: Идентификатор...

source: Code............
ru_ru: Код.............

source: Small name......
ru_ru: Короткое имя....

source: User name.......
ru_ru: Имя пользователя....

source: Data class......
ru_ru: Класс данных....

source: List of posting
ru_ru: Список проводок

source: Debet..............Kredit
ru_ru: Дебет..............Кредит

source: Generation avtomatically
ru_ru: Присваивается автоматически

source: Choice debet account
ru_ru: Выбрать дебетовый счет

source: Choice kredit account
ru_ru: Выбрать кредитовый счет

source: Error writing tmp file:
ru_ru: Ошибка записи во временный файл:

source: Save changed data ?
ru_ru: Сохранить измененные данные ?

source: Yes
ru_ru: Да

source: No
ru_ru: Нет

source: Attribute parameters
ru_ru: Параметры аттрибута

source: Name............
ru_ru: Название........

source: Undefined
ru_ru: Неопределен

source: Type............
ru_ru: Тип.............

source: Length..........
ru_ru: Длина...........

source: Type length....
ru_ru: Тип длины.......

source: Decimals........
ru_ru: Точность........

source: Reference to....
ru_ru: Ссылка на ......

source: (Unknown name)
ru_ru: (неизвестно)

source: (ANY OBJECT)
ru_ru: (ЛЮБОЙ ОБЪЕКТ)

source: Picture mask....
ru_ru: Шаблон формата..

source: Default value...
ru_ru: Значение по умол.

source: Counter name....
ru_ru: Имя счетчика....

source: No
ru_ru: Нет

source: Source code.....
ru_ru: Текст программы.

source: This attribute have ###### references from classes
ru_ru: Аттрибут имеет ###### ссылок из классов

source: Can`t edit information
ru_ru: Невозможно редактировать информацию

source: (NONE COUNTER)
ru_ru: (НЕТ СЧЕТЧИКА)

source: CLASS parameters
ru_ru: патаметры класса

source: Extent..........
ru_ru: Пространство....

source: (NONE)
ru_ru: (НЕТ)

source: Super class.....
ru_ru: Супер класс.....

source: Essence.........
ru_ru: Суть............

source: Unique key......
ru_ru: Уникальный ключ.

source: Logging need....
ru_ru: Журналирование..

source: Status:
ru_ru: статус:

source: Unstable
ru_ru: Нестаб.

source: Stable
ru_ru: Стаб..

source: Have counters:
ru_ru: Есть счетчик:

source: Attributes.Name.............Type..Len...Dec..
ru_ru: Аттритуты..Имя..............Тип..Длина..Точн.

source: Error access to identification:
ru_ru: Ошибка доступа к идентификатору:

source: Indexes....Name.............Expression.......
ru_ru: Индексы....Название.........Выражение........

source: Attributes....Name.............Type..Len...Dec..
ru_ru: Аттрибуты.....Имя..............Тип..Длина..Точн.

source: Indexes.......Name.............Expression.......
ru_ru: Индексы.......Название.........Выражение........

source: Error loading attribute metadata
ru_ru: Ошибка чтения метаданных аттрибута

source: Counter parameters
ru_ru: Параметры счетчика

source: Depository......
ru_ru: Депозитарий.....

source: MAX value.......
ru_ru: MAX значение....

source: LAST value......
ru_ru: LAST значение...

source: OBJECT parameters
ru_ru: Параметры объекта

source: This object don`t have CLASS description
ru_ru: Этот объект не имеет описателя класса

source: This object of CLASS:
ru_ru: Объект класса:

source: Depository parameters
ru_ru: Параметры депозитария

source: Cluster size....
ru_ru: Размер кластера.

source: Number..........
ru_ru: Номер...........

source: Extent parameters
ru_ru: Параметры пространства

source: Description.....
ru_ru: Описание........

source: Group parameters
ru_ru: Параметры группы

source: INDEX parameters
ru_ru: Параметры индекса

source: Expression......
ru_ru: Выражение.......

source: PLUGINS parameters
ru_ru: Параметры модуля

source: File name.......
ru_ru: Имя файла.......

source: Main function...
ru_ru: Главная функция.

source: Class...........
ru_ru: Имя класса......

source: REPORT parameters
ru_ru: Парметры отчета

source: Group...........
ru_ru: Имя группы......

source: User............
ru_ru: Пользователь....

source: TColumn parameters
ru_ru: Параметры столбца

source: Width...........
ru_ru: Ширина..........

source: Header..........
ru_ru: Заголовок.......

source: Footer..........
ru_ru: Подвал..........

source: Depend of.......
ru_ru: Зависит от......

source: References to
ru_ru: Ссылается на

source: TVIEW parameters
ru_ru: Параметры таблицы

source: Columns.......Name.............Header...........
ru_ru: Столбец.......Название.........Заголовок........

source: Error access
ru_ru: Ошибка доступа

source: User parameters
ru_ru: Параметры пользователя

source: Access rules....
ru_ru: Правила доступа.

source: Object not found:
ru_ru: Объект не найден:

source: Counter name not found:
ru_ru: Не найдено имя счетчика:
